CREATE VIEW dbo.[ПасажирП] AS	
SELECT DISTINCT Код_пасажира, Імя_пасажира,Прізвище_пасажира FROM Пасажир
GO 

CREATE VIEW ВагонП AS	
SELECT DISTINCT * FROM Вагон

SELECT * FROM ВагонП
WHERE Тип_вагона = 'Другий клас'
GO 

SELECT ПасажирП.Імя_пасажира, ПасажирП.Прізвище_пасажира, ВагонП.Тип_вагона as 'Вибраний клас вагона' 
FROM ПасажирП, ВагонП
WHERE ПасажирП.Код_пасажира = ВагонП.Код_вагона

SELECT ПасажирП.Імя_пасажира, ПасажирП.Прізвище_пасажира, ВагонП.Тип_вагона as 'Вибраний клас вагона' 
FROM ПасажирП, ВагонП
WHERE ПасажирП.Код_пасажира = ВагонП.Код_вагона AND ВагонП.Тип_вагона = 'Другий клас'
